{"pageProps":{"postData":{"id":"what_is_ds","contentHtml":"<h1>What is Data Science?</h1>\n<h2>1. What do data scientists do?</h2>\n<p>Our goal as data scientists is to extract some sort of meaning from data. Generally, we are working on one of two tasks: predicting some output based on known inputs, or trying to visualize/understand some data. When we work on competitions (<a href=\"https://www.kaggle.com/\">Kaggle</a>, <a href=\"https://www.drivendata.org/\">DrivenData</a>), we often do both.</p>\n<h3>1a. Predicting something:</h3>\n<p>When we work on competitions, the goal is to predict some output variable based on inputs that are given to us. In machine learning, we usually call the output variable the label, and the inputs are called features. There are (generally) two types of prediction tasks: classification, and regression.</p>\n<p>Classification refers to making a categorical prediction, meaning our output will fall into some number of discrete categories. For example, maybe we are trying to determine whether something is garbage, recycling, or compost. In this case, we have three disjoint categories.</p>\n<p>The other is regression. Regression means we are trying to predict some continuous variable. Maybe the price of a house, or the amount of rainfall (by inches) for a given month. These types of variables don’t just take on a discrete number of values, but rather a continuous value in a given range.</p>\n<h2>2. What does the workflow usually look like?</h2>\n<p>It’s important to understand what our general goal is, but equally as important to understand the tech stack behind our work. The general data science modeling workflow goes something like this:</p>\n<ul>\n<li>Figure out what we are trying to predict, and whether we are performing a classification or regression task.</li>\n<li>Look through our data.</li>\n<li>Choose a machine learning model.</li>\n<li>Make some predictions.</li>\n<li>Test how well our model is doing.</li>\n<li>Repeat 3-5 until we are satisfied with our results.</li>\n</ul>\n<p>Step (2) is often called Exploratory Data Analysis, or EDA for short. This often involves using some visualization libraries like <a href=\"https://matplotlib.org/\"><code>matplotlib</code></a> to better understand our data, and should not be overlooked.</p>\n<h2>3. How do I do this myself?</h2>\n<p>For manipulating our datasets, we usually use the Python library <a href=\"https://pandas.pydata.org/\"><code>pandas</code></a>. Essentially, we can usually think of numerical data as a spreadsheet or excel table, where each row is an observation, each column is a feature. Pandas allows us to easily and efficiently work with these tables (called <code>DataFrames</code>).</p>\n<p>There are several libraries we commonly use to create machine learning models. For classical models, <a href=\"https://scikit-learn.org/stable/\">Scikit-Learn</a>, provides quick model generation and also implements options for model testing and evaluation. <a href=\"https://www.tensorflow.org/\">Tensorflow</a> and <a href=\"https://pytorch.org/\">PyTorch</a> are usually used for deep learning models.</p>\n<p>Finally, it is important to keep track of your files and where you are in your workflow, especially when working in a team. For this reason, we strongly recommend you learn <code>git</code>.</p>\n","date":"2020-06-05","title":"What is data science?","blog":false},"peopleInfo":null},"__N_SSG":true}