{"pageProps":{"postData":{"id":"resources","contentHtml":"<h1>Getting Started</h1>\n<h2>Software setup guide</h2>\n<p>This is the software we use to work on projects.</p>\n<h4>Slack</h4>\n<p>Most club communications will be through <a href=\"https://slack.com/\">Slack</a>.</p>\n<h4>Github</h4>\n<p>You should have a <a href=\"https://github.com/\">Github</a> account.\nMessage Julan Lehrer or Anders Poirel on Slack so that you can be added to our\norganization on Github. This is will be necessary for ushing your contributions\nto team repositories and joining live coding sessions.</p>\n<h4>Git</h4>\n<p>To be effective you will also need <a href=\"https://git-scm.com/downloads\">git</a> locally. Be sure to select Git Bash at installation if you use Windows.\nIf you do not know any git, <a href=\"https://git-scm.com/book/en/v2\">Pro Git</a> is a great resource to get you started </p>\n<ul>\n<li>reading the first two chapters will be enough for a working knowledge of Git.</li>\n</ul>\n<h4>Visual Studio Code</h4>\n<p>You can use any text editor you want, but VS Code has useful live collaboration\nfeatures for club meetings.\nGet the official installer <a href=\"https://code.visualstudio.com/\">here</a>.\nRecommended extensions (<em>Ctrl+Shift+X</em> to access extension menu):</p>\n<ul>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=MS-vsliveshare.vsliveshare\">VS Live Share</a>: live collaboration</li>\n<li><a href=\"https://marketplace.visualstudio.com/items?itemName=ms-python.python\">Python</a>: syntax highlighting, IPython and Jupyter Notebook support</li>\n</ul>\n<h4>Conda</h4>\n<p><em>Note: this is only necessary if you intend to run code on your local machine. You can get started without it.</em></p>\n<p>Anaconda is the go-to Python distribution, and the <code>conda</code> package manager will\nhelp you circumvent many dependency issues.\nI recommend <a href=\"https://docs.conda.io/en/latest/miniconda.html\">miniconda</a>. This is a minimal installation of Anaconda without the (buggy) GUI software.\nIt is good practice to create seperate environments for each project to avoid dependency conflict.</p>\n<ul>\n<li>we recommend the <a href=\"https://docs.conda.io/projects/conda/en/latest/user-guide/getting-started.html\">official tutorial</a> to get started </li>\n</ul>\n<h5>Alternative</h5>\n<p><a href=\"https://colab.research.google.com/\">Google Colab</a> runs in the browser and comes with\nall the libraries you need to do basic data science in Python. This will get you\nstarted if you don't want to install anything.</p>\n<h2>Recommended Readings</h2>\n<p>We recommend the following books as references for data science basics. All are available legally for free online.</p>\n<p>Programming - Choose one depending on whether you prefer Python or R: </p>\n<ul>\n<li><a href=\"https://jakevdp.github.io/WhirlwindTourOfPython/\">A Whirlwind Tour of Python</a>, <a href=\"https://jakevdp.github.io/PythonDataScienceHandbook/\">Python Data Science Handbook</a>, Jake VanderPlas. A Whirlwind Tour reviews Python syntax. The Handbook teaches the main Python data science libraries (Pandas, Matplotlib, Scikit-Learn)</li>\n<li><a href=\"https://r4ds.had.co.nz/\">R for Data Science</a>, Hadley Wickham teaches modern R syntax and the Tidyverse family of libraries for working with data </li>\n</ul>\n<p>Theory - fundamentals of statistics and mathematics for data science:</p>\n<ul>\n<li><a href=\"http://faculty.marshall.usc.edu/gareth-james/ISL/\">Introduction to Statistical Learning</a>, Gareth James, Daniela Witten, Trevor Hastie and Robert Tibshirani. Theory fundamentals (regression, classification, validation, clustering) using high-school level math</li>\n<li><a href=\"https://link.springer.com/book/10.1007/978-3-319-55444-0\">Data Science Design Manual</a> (Requires UCSC network/VPN), Steven Skiena. An overview of fundamental techniques and problems in data science.</li>\n</ul>\n<h2>Useful documents</h2>\n<ul>\n<li><a href=\"https://github.com/datascienceslugs/Useful-Documents/blob/master/CONTRIBUTING.md\">Software Contribution Guide</a></li>\n</ul>\n","date":"2020-06-05","title":"Resources","blog":false},"peopleInfo":null},"__N_SSG":true}